; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v5 ?v2)
             (pred_12 ?v10 ?v12)
             (pred_1 ?v5 ?v12)
             (pred_3 ?v13 ?v5 )
	     (pred_11 ?v5)
             (pred_9 ?v8)
             (pred_2 ?v10)
             (pred_6 ?v12)
             (pred_5 ?v5)
             (pred_10 ?v10)
             (pred_4 ?v5)
             (pred_7 ))



(:action op_1
:parameters (?v11 ?v6 ?v3 ?v1)
:precondition (and (pred_9 ?v11) (pred_9 ?v6) (pred_2 ?v3) (pred_6 ?v1)
          (pred_8 ?v11 ?v6) (pred_12 ?v3 ?v1)
                   (pred_1 ?v6 ?v1) (pred_11 ?v11) 
                   (pred_5 ?v6) (pred_10 ?v3))
:effect (and  (pred_4 ?v6) (not (pred_5 ?v6))))


(:action op_5
:parameters (?v11 ?v9)
:precondition (and (pred_9 ?v11) (pred_9 ?v9)
               (pred_11 ?v11) (pred_8 ?v11 ?v9) (pred_4 ?v9))
:effect (and (pred_11 ?v9) (not (pred_11 ?v11))))

(:action op_2
:parameters (?v11 ?v3)
:precondition (and (pred_9 ?v11) (pred_2 ?v3) 
                  (pred_11 ?v11) (pred_3 ?v3 ?v11) (pred_7 ))
:effect (and (pred_10 ?v3)
   (not (pred_3 ?v3 ?v11)) (not (pred_7 ))))


(:action op_3
:parameters (?v11 ?v7 ?v4)
:precondition (and (pred_9 ?v11) (pred_2 ?v7) (pred_2 ?v4)
                  (pred_11 ?v11) (pred_10 ?v4) (pred_3 ?v7 ?v11))
:effect (and (pred_10 ?v7) (pred_3 ?v4 ?v11)
        (not (pred_10 ?v4)) (not (pred_3 ?v7 ?v11))))

(:action op_4
:parameters (?v11 ?v3)
:precondition (and (pred_9 ?v11) (pred_2 ?v3) 
                  (pred_11 ?v11) (pred_10 ?v3))
:effect (and (pred_7 ) (pred_3 ?v3 ?v11) (not (pred_10 ?v3)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_31 obj_07 obj_27 obj_04 obj_10 obj_17 obj_06 obj_20 obj_02 obj_09 obj_14 obj_05 obj_11 obj_21 obj_19 obj_15 obj_25 obj_12 obj_16 obj_08 obj_26 obj_01 obj_24 obj_23 obj_28
    obj_13 obj_18 obj_30
    obj_29 obj_22 obj_03
    )

    (:init
       (pred_7)

       (pred_9 obj_31)
       (pred_9 obj_07)
       (pred_9 obj_27)
       (pred_9 obj_04)
       (pred_9 obj_10)
       (pred_9 obj_17)
       (pred_9 obj_06)
       (pred_9 obj_20)
       (pred_9 obj_02)
       (pred_9 obj_09)
       (pred_9 obj_14)
       (pred_9 obj_05)
       (pred_9 obj_11)
       (pred_9 obj_21)
       (pred_9 obj_19)
       (pred_9 obj_15)
       (pred_9 obj_25)
       (pred_9 obj_12)
       (pred_9 obj_16)
       (pred_9 obj_08)
       (pred_9 obj_26)
       (pred_9 obj_01)
       (pred_9 obj_24)
       (pred_9 obj_23)
       (pred_9 obj_28)
       (pred_6 obj_13)
       (pred_6 obj_18)
       (pred_6 obj_30)
       (pred_2 obj_29)
       (pred_2 obj_22)
       (pred_2 obj_03)

       (pred_8 obj_31 obj_17)
       (pred_8 obj_31 obj_07)
       (pred_8 obj_07 obj_06)
       (pred_8 obj_07 obj_27)
       (pred_8 obj_07 obj_31)
       (pred_8 obj_27 obj_20)
       (pred_8 obj_27 obj_04)
       (pred_8 obj_27 obj_07)
       (pred_8 obj_04 obj_02)
       (pred_8 obj_04 obj_10)
       (pred_8 obj_04 obj_27)
       (pred_8 obj_10 obj_09)
       (pred_8 obj_10 obj_04)
       (pred_8 obj_17 obj_14)
       (pred_8 obj_17 obj_06)
       (pred_8 obj_17 obj_31)
       (pred_8 obj_06 obj_05)
       (pred_8 obj_06 obj_20)
       (pred_8 obj_06 obj_07)
       (pred_8 obj_06 obj_17)
       (pred_8 obj_20 obj_11)
       (pred_8 obj_20 obj_02)
       (pred_8 obj_20 obj_27)
       (pred_8 obj_20 obj_06)
       (pred_8 obj_02 obj_21)
       (pred_8 obj_02 obj_09)
       (pred_8 obj_02 obj_04)
       (pred_8 obj_02 obj_20)
       (pred_8 obj_09 obj_19)
       (pred_8 obj_09 obj_10)
       (pred_8 obj_09 obj_02)
       (pred_8 obj_14 obj_15)
       (pred_8 obj_14 obj_05)
       (pred_8 obj_14 obj_17)
       (pred_8 obj_05 obj_25)
       (pred_8 obj_05 obj_11)
       (pred_8 obj_05 obj_06)
       (pred_8 obj_05 obj_14)
       (pred_8 obj_11 obj_12)
       (pred_8 obj_11 obj_21)
       (pred_8 obj_11 obj_20)
       (pred_8 obj_11 obj_05)
       (pred_8 obj_21 obj_16)
       (pred_8 obj_21 obj_19)
       (pred_8 obj_21 obj_02)
       (pred_8 obj_21 obj_11)
       (pred_8 obj_19 obj_08)
       (pred_8 obj_19 obj_09)
       (pred_8 obj_19 obj_21)
       (pred_8 obj_15 obj_26)
       (pred_8 obj_15 obj_25)
       (pred_8 obj_15 obj_14)
       (pred_8 obj_25 obj_01)
       (pred_8 obj_25 obj_12)
       (pred_8 obj_25 obj_05)
       (pred_8 obj_25 obj_15)
       (pred_8 obj_12 obj_24)
       (pred_8 obj_12 obj_16)
       (pred_8 obj_12 obj_11)
       (pred_8 obj_12 obj_25)
       (pred_8 obj_16 obj_23)
       (pred_8 obj_16 obj_08)
       (pred_8 obj_16 obj_21)
       (pred_8 obj_16 obj_12)
       (pred_8 obj_08 obj_28)
       (pred_8 obj_08 obj_19)
       (pred_8 obj_08 obj_16)
       (pred_8 obj_26 obj_01)
       (pred_8 obj_26 obj_15)
       (pred_8 obj_01 obj_24)
       (pred_8 obj_01 obj_25)
       (pred_8 obj_01 obj_26)
       (pred_8 obj_24 obj_23)
       (pred_8 obj_24 obj_12)
       (pred_8 obj_24 obj_01)
       (pred_8 obj_23 obj_28)
       (pred_8 obj_23 obj_16)
       (pred_8 obj_23 obj_24)
       (pred_8 obj_28 obj_08)
       (pred_8 obj_28 obj_23)
       (pred_5 obj_09)
       (pred_5 obj_08)
       (pred_5 obj_25)
       (pred_1  obj_09 obj_13)
       (pred_1  obj_08 obj_18)
       (pred_1  obj_25 obj_30)
       (pred_4 obj_31)
       (pred_4 obj_07)
       (pred_4 obj_27)
       (pred_4 obj_04)
       (pred_4 obj_10)
       (pred_4 obj_17)
       (pred_4 obj_06)
       (pred_4 obj_20)
       (pred_4 obj_02)
       (pred_4 obj_14)
       (pred_4 obj_05)
       (pred_4 obj_11)
       (pred_4 obj_21)
       (pred_4 obj_19)
       (pred_4 obj_15)
       (pred_4 obj_12)
       (pred_4 obj_16)
       (pred_4 obj_26)
       (pred_4 obj_01)
       (pred_4 obj_24)
       (pred_4 obj_23)
       (pred_4 obj_28)

       (pred_12  obj_29 obj_13)
       (pred_12  obj_22 obj_18)
       (pred_12  obj_03 obj_30)
       (pred_3 obj_29 obj_05)
       (pred_3 obj_22 obj_28)
       (pred_3 obj_03 obj_26)
       (pred_11 obj_28)
    )

    (:goal (and
       (pred_3 obj_03 obj_20)
    ))
(:constraints
  (always (not (pred_11 obj_06)))
)
)

; plan
1. (op_5 obj_28 obj_23)
   deleted: (pred_11 obj_28)
   added: (pred_11 obj_23)
   goals met: 0 of 1
2. (op_5 obj_23 obj_24)
   deleted: (pred_11 obj_23)
   added: (pred_11 obj_24)
   goals met: 0 of 1
3. (op_5 obj_24 obj_01)
   deleted: (pred_11 obj_24)
   added: (pred_11 obj_01)
   goals met: 0 of 1
4. (op_5 obj_01 obj_26)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_26)
   goals met: 0 of 1
5. (op_2 obj_26 obj_03)
   deleted: (pred_3 obj_03 obj_26) (pred_7)
   added: (pred_10 obj_03)
   goals met: 0 of 1
6. (op_5 obj_26 obj_15)
   deleted: (pred_11 obj_26)
   added: (pred_11 obj_15)
   goals met: 0 of 1
7. (op_5 obj_15 obj_14)
   deleted: (pred_11 obj_15)
   added: (pred_11 obj_14)
   goals met: 0 of 1
8. (op_5 obj_14 obj_05)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_05)
   goals met: 0 of 1
9. (op_5 obj_05 obj_11)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_11)
   goals met: 0 of 1
10. (op_5 obj_11 obj_20)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_20)
   goals met: 0 of 1
11. (op_4 obj_20 obj_03)
   deleted: (pred_10 obj_03)
   added: (pred_7) (pred_3 obj_03 obj_20)
   goals met: 1 of 1
